### Create a Dataframe using dictionary

Name = Cathy, Sandra, George, Joel, Jeni<br>
Age = 23, 28, 25, 26,30<br>
Favourite sports = Cricket, BasketBall, Cricket, Basketball, Soccer

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Name':['Cathy', 'Sandra', 'George', 'Joel', 'Jeni'],
                    'Age': [23, 28, 25, 26, 30],
                    'Favourite Sports': ['Cricket', 'BasketBall', 'Cricket','BasketBall', 'Soccer']})

In [3]:
df

     Name  Age Favourite Sports
0   Cathy   23          Cricket
1  Sandra   28       BasketBall
2  George   25          Cricket
3    Joel   26       BasketBall
4    Jeni   30           Soccer

### Get the details of George using index location

In [4]:
df.iloc[2]

Name                 George
Age                      25
Favourite Sports    Cricket
Name: 2, dtype: object

### Add one more column 'Height'= [160, 154, 158, 165, 160] to the dataframe

In [5]:
df['Height']= [160, 154, 158, 165, 160]

In [6]:
df

     Name  Age Favourite Sports  Height
0   Cathy   23          Cricket     160
1  Sandra   28       BasketBall     154
2  George   25          Cricket     158
3    Joel   26       BasketBall     165
4    Jeni   30           Soccer     160

### print the column 'Age'

In [7]:
df['Age']

0    23
1    28
2    25
3    26
4    30
Name: Age, dtype: int64

### Find out the five number summary

In [8]:
df.describe()

             Age      Height
count   5.000000    5.000000
mean   26.400000  159.400000
std     2.701851    3.974921
min    23.000000  154.000000
25%    25.000000  158.000000
50%    26.000000  160.000000
75%    28.000000  160.000000
max    30.000000  165.000000

### Create the Dataframe using list with index = 4, 8, 1, 3, 9

Name = Cathy, Sandra, George, Joel, Jeni
Age = 23, 28, 25, 26,30
Favourite sports = Cricket, BasketBall, Cricket, Basketball, Soccer

In [9]:
df = pd.DataFrame([['Cathy',23, 'Cricket'],
                   ['Sandra', 28, 'BasketBall'],
                   ['George', 25, 'Cricket'],["Joel", 26, 'BasketBall'], ['Jeni', 30, 'Soccer']],
                   index = [4,8,1, 3, 9],columns =['Name', 'Age', 'Favourite sports'])

In [10]:
df

     Name  Age Favourite sports
4   Cathy   23          Cricket
8  Sandra   28       BasketBall
1  George   25          Cricket
3    Joel   26       BasketBall
9    Jeni   30           Soccer

### Sort by index

In [11]:
df= df.sort_index()

In [12]:
df

     Name  Age Favourite sports
1  George   25          Cricket
3    Joel   26       BasketBall
4   Cathy   23          Cricket
8  Sandra   28       BasketBall
9    Jeni   30           Soccer

### Print the person whose Favourite sports is Soccer

In [13]:
df['Favourite sports'] == 'Soccer'

1    False
3    False
4    False
8    False
9     True
Name: Favourite sports, dtype: bool